cases/12_h6_s4/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  www.openfoam.com
    \\  /    A nd           | Version:  v2106
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0       0       0)      // 0
    (100     0       0)      // 1
    (100     10      0)      // 2
    (0       10      0)      // 3
    (0       0       1)      // 4
    (100     0       1)      // 5
    (100     10      1)      // 6
    (0       10      1)      // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 10 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    
    wall_bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    
    wall_top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    
    fins
    {
        type wall;
        faces ();
    }
    
    front
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }
    
    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
